[RM_Terror_Defence X2MissionTemplate]
+DisplayName="Defend Resistance Haven"
+Briefing="Defend Haven - ADVENT Siege"
+PostMissionType="Defend Resistance Haven"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="Neutralize all enemy targets or evac after primary objective completion"
+ObjectiveTextPools[1]="Defend haven long enough for non-combatants to evacuate"
+PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Unique.Central_Unique_Missions_Terror_Attack"
+PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_02"
+PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_03"
+PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_04"
+PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_05"
+PreMissionNarratives[5]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_01"
+PreMissionNarratives[6]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_02"
+PreMissionNarratives[7]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_03"
+PreMissionNarratives[8]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_04"
+PreMissionNarratives[9]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_05"

[RM_GuerillaOp_Neutralize X2MissionTemplate]
+DisplayName="Neutralize ADVENT VIP on PR Tour"
+Briefing="Neutralize ADVENT VIP"
+PostMissionType="Neutralize ADVENT VIP on PR Tour"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="Capture or Kill Enemy VIP"
+PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_01"
+PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_02"
+PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_03"
+PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_04"
+PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_05"

[MissionTimers]
+TimerTerrorDefenceTitle="Haven Evacuation"
+TimerTerrorDefenceSubtitle="Turns until completion"
+TimerGuerillaVIPTitle="Firebrand's Return"
+TimerGuerillaVIPSubtitle="Turns until arrival"

[RM_Terror_Defence X2MissionNarrativeTemplate]
+ObjectiveTextPools[0]="Defend against ADVENT siege"
+ObjectiveTextPools[1]="Neutralize all enemy targets"
+ObjectiveTextPools[2]="Extract all XCOM soldiers"

[RM_GuerillaOp_Neutralize X2MissionNarrativeTemplate]
+ObjectiveTextPools[0]="Hold out until Firebrand returns to AO"
+ObjectiveTextPools[1]="Capture or kill ADVENT VIP"
+ObjectiveTextPools[2]="Extract ADVENT VIP"
+ObjectiveTextPools[3]="Extract all XCOM soldiers"
